yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceEnrollment/main.cpp
						for(int i = 0; i < infFramebuf->results_FR.size(); i++)
						{
							lableInfo += ":";
							lableInfo += std::to_string(infFramebuf->results_FR[i]);
						}
						lableInfo += ":";
						lableInfo += "\n";

						toWrite = lableInfo.length();

						if(toWrite < LABEL_INFO_BUF_LEN)
						{
							//copy to label information buffer
							memcpy(labelInfoBuf, lableInfo.c_str(), toWrite);							
							labelInfoBuf[toWrite] = '\0';
							info("The label info is %s \n", labelInfoBuf);

							//Write label information to file
							written = LabelFileWriter_WriteData((BYTE *)labelInfoBuf, toWrite);
							
							if(written != toWrite){
								info("Write label info to file error %d, %d\n", toWrite, written);
								info("Please delete %s, and try again \n", FACE_LABEL_FILE);
								while(1){
									__NOP();
								}
							}
						}
						else
						{
							info("The label info buffer is too small. it should be large than %d", toWrite);
						}

						print_usage();
					}
				}
			}

#if defined (__USE_DISPLAY__)

			sDispRect.u32TopLeftX = 0;
			sDispRect.u32TopLeftY = frameBuffer.h * IMAGE_DISP_UPSCALE_FACTOR;
			sDispRect.u32BottonRightX = (frameBuffer.w * IMAGE_DISP_UPSCALE_FACTOR);
			sDispRect.u32BottonRightY = ((frameBuffer.h * IMAGE_DISP_UPSCALE_FACTOR)+ (FONT_DISP_UPSCALE_FACTOR * FONT_HTIGHT) - 1);

			Display_ClearRect(C_WHITE, &sDispRect);

			if(infFramebuf->results_FD.size()){
				sprintf(szDisplayText, "%s", labelInfo.c_str());

				Display_PutText(
					szDisplayText,
					strlen(szDisplayText),
					0,
					frameBuffer.h * IMAGE_DISP_UPSCALE_FACTOR,
					C_BLUE,
					C_WHITE,
					true,
					FONT_DISP_UPSCALE_FACTOR
				);
			}
#endif
			
			
            u64PerfFrames ++;
			if ((uint64_t) pmu_get_systick_Count() > u64PerfCycle)
            {
                info("Total inference rate: %llu\n", u64PerfFrames / EACH_PERF_SEC);
#if defined (__USE_DISPLAY__)
                sprintf(szDisplayText, "Frame Rate %llu", u64PerfFrames / EACH_PERF_SEC);
                //sprintf(szDisplayText,"Time %llu",(uint64_t) pmu_get_systick_Count() / (uint64_t)SystemCoreClock);
                //info("Running %s sec \n", szDisplayText);

                sDispRect.u32TopLeftX = 0;
				sDispRect.u32TopLeftY = frameBuffer.h + (FONT_HTIGHT * FONT_DISP_UPSCALE_FACTOR);
				sDispRect.u32BottonRightX = (frameBuffer.w);
				sDispRect.u32BottonRightY = (frameBuffer.h + (2 * FONT_HTIGHT * FONT_DISP_UPSCALE_FACTOR) - 1);

                Display_ClearRect(C_WHITE, &sDispRect);
                Display_PutText(
                    szDisplayText,
                    strlen(szDisplayText),
                    0,
					(frameBuffer.h * IMAGE_DISP_UPSCALE_FACTOR)+ FONT_HTIGHT * FONT_DISP_UPSCALE_FACTOR,
                    C_BLUE,
                    C_WHITE,
                    false,
					FONT_DISP_UPSCALE_FACTOR
                );
#endif
                u64PerfCycle = (uint64_t)pmu_get_systick_Count() + (uint64_t)(SystemCoreClock * EACH_PERF_SEC);
                u64PerfFrames = 0;
			}

            infFramebuf->eState = eFRAMEBUF_EMPTY;
		}

		//Wait CCAP ready
		if (emptyFramebuf)
		{
#if defined (__USE_CCAP__)			
			//Capture new image
			ImageSensor_WaitCaptureDone();
#endif
#if defined(__PROFILE__)
			u64CCAPEndCycle = pmu_get_systick_Count();
			info("ccap capture cycles %llu \n", (u64CCAPEndCycle - u64CCAPStartCycle));
#endif
            emptyFramebuf->eState = eFRAMEBUF_FULL;		
		}			
	}
#if !defined (__USE_CCAP__)
prog_done:
#endif
	LabelFileWriter_Finish();

	SDH_Close_Disk(SDH0);
	return 0;
}

